----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv1d-1              [32, 128, 64]         295,040
       BatchNorm1d-2              [32, 128, 64]             256
              ReLU-3              [32, 128, 64]               0
            Conv1d-4              [32, 128, 64]          49,280
       BatchNorm1d-5              [32, 128, 64]             256
              ReLU-6              [32, 128, 64]               0
            Conv1d-7              [32, 256, 64]          98,560
              ReLU-8              [32, 256, 64]               0
            Conv1d-9              [32, 256, 64]         196,864
      BatchNorm1d-10              [32, 256, 64]             512
             ReLU-11              [32, 256, 64]               0
              GRU-12  [[-1, 64, 256], [-1, 2, 256]]               0
AdaptiveAvgPool1d-13               [32, 256, 1]               0
           Linear-14                  [32, 128]          32,896
     Text_Encoder-15                  [32, 128]               0
           Linear-16                [32, 32768]       4,227,072
      BatchNorm1d-17                [32, 32768]          65,536
  ConvTranspose3d-18         [32, 512, 8, 8, 8]      16,777,728
      BatchNorm3d-19         [32, 512, 8, 8, 8]           1,024
  ConvTranspose3d-20      [32, 256, 16, 16, 16]       8,388,864
      BatchNorm3d-21      [32, 256, 16, 16, 16]             512
  ConvTranspose3d-22      [32, 128, 32, 32, 32]       2,097,280
      BatchNorm3d-23      [32, 128, 32, 32, 32]             256
  ConvTranspose3d-24        [32, 4, 32, 32, 32]          13,828
Text2ShapeGenerator-25        [32, 4, 32, 32, 32]               0
================================================================
Total params: 32,245,764
Trainable params: 32,245,764
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 6.00
Forward/backward pass size (MB): 2864.12
Params size (MB): 123.01
Estimated Total Size (MB): 2993.13
----------------------------------------------------------------






